<a href="https://colab.research.google.com/github/LazarkoAnastasiia/DS_KNU/blob/main/Untitled14.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Я обрала базу даних з інформацією щодо видобутку та переробки уранової сировини
#Даний документ містить такі стовбці "Рік, місяць, вид діяльності, вид продукту, кількість, вартість"
#Джерело даних: https://data.gov.ua/dataset/d1be130c-4b9d-4790-a44d-05caefc41fed
# В даному фрагменті я продемонструвала базу даних

def print_full(x):
    pd.set_option('display.max_rows', len(x))
    print(x)
    pd.reset_option('display.max_rows')
import pandas as pd
import numpy as np
uranus = pd.read_excel('D:/Дз/Пайтон/nuclear_production.xlsx')
uranus.set_index('year', inplace=True)
del uranus['code']
del uranus['enterprise']

print(uranus)

      month     activity product    amount      cost
year
2018      1    видобуток      УР  60095.00       NaN
2018      1  виробництво     УОК    139.20  429966.4
2018      2    видобуток      УР  57140.00       NaN
2018      2  виробництво     УОК    162.30  504702.3
2018      3    видобуток      УР  61277.00       NaN
...     ...          ...     ...       ...       ...
2021      2  виробництво     УОК     31.37   91340.0
2021      3    видобуток      УР  45708.00       NaN
2021      3  виробництво     УОК     49.80  145183.6
2021      4    видобуток      УР  42771.00       NaN
2021      4  виробництво     УОК     37.80  110073.6

[80 rows x 5 columns]

In [ ]:
#Завдання 1: знайти середню вартість для таких видів активності як "видобуток" та "виробництво" вцілому за весь період діяльності
def answer_one():
    
    p= uranus.sort_values(by=['year'],ascending=True)
    k = uranus.groupby(["activity"]).mean()
    #print(k['amount'])
    l = uranus[['cost']].max()
    res = [uranus['cost'].idxmax(), uranus['cost'].max()]
    
    #print(res)
    return k['amount']
answer_one()

activity
видобуток      49279.05000
виробництво       71.88025
Name: amount, dtype: float64

In [ ]:
#Завдання 2: Яка найбільша вартість виробництва уранової руди та у якому році було дане значення
def answer_two():
    
    p= uranus.sort_values(by=['year'],ascending=True)
    res = [uranus['cost'].idxmax(), uranus['cost'].max()]
    return res
answer_two()

[2018, 616335.5]

In [ ]:
#Завдання 3: згрупувати дані по роках та визначити середні значення кількості та вартості створення уранової руди по кожному з років
def answer_three():
    df_3 = uranus.copy()
    p = df_3.sort_values(by=['year'],ascending=True)
    k = df_3.groupby(["year"]).mean(['cost','amount'])
    del k ["month"]
    p['year'] = p[['cost']].mean(axis=1)
    return k
answer_three()

            amount           cost
year
2018  30022.729167  299085.091667
2019  23295.162500  156063.883333
2020  22453.611250  172801.575000
2021  19440.142500  110071.800000

In [ ]:
#Завдання 4: Згрупувати дані за видом діяльності (видобуток та виробництво) та за місяцями, знайти середнє значення видобутого та виробленого урану по кожному місяці року 
def answer_four():
    df_4 = uranus.copy()
    print(df_4)
    del df_4['cost']
    k = df_4.groupby([ 'activity','month',]).mean()
    return k
answer_four()

      month     activity product    amount      cost
year
2018      1    видобуток      УР  60095.00       NaN
2018      1  виробництво     УОК    139.20  429966.4
2018      2    видобуток      УР  57140.00       NaN
2018      2  виробництво     УОК    162.30  504702.3
2018      3    видобуток      УР  61277.00       NaN
...     ...          ...     ...       ...       ...
2021      2  виробництво     УОК     31.37   91340.0
2021      3    видобуток      УР  45708.00       NaN
2021      3  виробництво     УОК     49.80  145183.6
2021      4    видобуток      УР  42771.00       NaN
2021      4  виробництво     УОК     37.80  110073.6

[80 rows x 5 columns]

                         amount
activity    month
видобуток   1      45039.000000
            2      46715.500000
            3      50515.000000
            4      48736.500000
            5      38963.333333
            6      45135.666667
            7      55893.333333
            8      51481.333333
            9      51789.000000
            10     58932.666667
            11     57653.666667
            12     42530.333333
виробництво 1         84.392500
            2         77.310000
            3         80.825000
            4         66.925000
            5         53.066667
            6         75.466667
            7         79.166667
            8         75.766667
            9         63.233333
            10        42.800000
            11        87.233333
            12        69.066667

In [ ]:
#Завдання 5: Знайти ціну за 1 одиницю виробленого урану( шляхом ділення вартості на кількість), згрупувати дані по роках, щоб знайти середню ціну по кожному року

def answer_five():
    print(uranus)
    df_5 = uranus.copy()
    df_5.dropna(subset=['cost'], inplace = True)
    df_5['price'] = df_5['cost']/df_5['amount']
    k = df_5.groupby(["year"]).mean()
    return   k
answer_five()

      month     activity product    amount      cost
year
2018      1    видобуток      УР  60095.00       NaN
2018      1  виробництво     УОК    139.20  429966.4
2018      2    видобуток      УР  57140.00       NaN
2018      2  виробництво     УОК    162.30  504702.3
2018      3    видобуток      УР  61277.00       NaN
...     ...          ...     ...       ...       ...
2021      2  виробництво     УОК     31.37   91340.0
2021      3    видобуток      УР  45708.00       NaN
2021      3  виробництво     УОК     49.80  145183.6
2021      4    видобуток      УР  42771.00       NaN
2021      4  виробництво     УОК     37.80  110073.6

[80 rows x 5 columns]

      month     amount           cost        price
year
2018    6.5  98.291667  299085.091667  3027.822467
2019    6.5  66.741667  156063.883333  2293.601916
2020    6.5  61.972500  172801.575000  2778.780627
2021    2.5  37.785000  110071.800000  2912.843275